#Область include_code_include2
#Область include_code_include1
Функция Ядро1(Форма,ИмяЭлемента)
КонецФункции
#КонецОбласти

Функция Ядро2(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции

#КонецОбласти

// функции для совместимости кода
&НаКлиенте
Функция Моя1(Форма,ИмяЭлемента)
КонецФункции



#Область include_code_include1
#КонецОбласти

// функции для совместимости кода
&НаКлиенте
Функция Моя2(Форма,ИмяЭлемента)
КонецФункции

